# BuiltInFailures.ConversionFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConversionFailures Class
BuiltInFailures Class Members See Also
---
Failures about conversion of data to a different format.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ConversionFailures
```

Visual Basic
---
```text
Public NotInheritable Class ConversionFailures
```

Visual C++
---
```text
public ref class ConversionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ConversionFailures
# See Also
BuiltInFailures..::..ConversionFailures Members
Autodesk.Revit.DB Namespace